-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: mydatabase01
-- ------------------------------------------------------
-- Server version	5.7.18-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `reply`
--

DROP TABLE IF EXISTS `reply`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `reply` (
  `no` int(11) NOT NULL AUTO_INCREMENT,
  `repno` int(11) DEFAULT NULL,
  `content` text,
  `writer` varchar(30) DEFAULT NULL,
  `regdate` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`no`),
  KEY `fk_reply_1` (`repno`),
  CONSTRAINT `fk_reply_1` FOREIGN KEY (`repno`) REFERENCES `board` (`no`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=73 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reply`
--

LOCK TABLES `reply` WRITE;
/*!40000 ALTER TABLE `reply` DISABLE KEYS */;
INSERT INTO `reply` VALUES (1,1,'댓글11','일지매','2017-11-28 18:38:34'),(2,1,'댓글12','홍길동','2017-11-28 18:38:34'),(3,1,'댓글13','이순신','2017-11-28 18:38:34'),(4,2,'댓글21','임꺽정','2017-11-28 18:38:34'),(5,2,'댓글22','김기동','2017-11-28 18:38:34'),(6,2,'댓글23','고길동','2017-11-28 18:38:34'),(7,3,'댓글31','일지매','2017-11-28 18:38:34'),(8,3,'댓글32','홍길동','2017-11-28 18:38:34'),(9,3,'댓글33','이순신','2017-11-28 18:38:34'),(10,2,'댓글41','임꺽정','2017-11-28 18:38:34'),(11,2,'댓글42','김기동','2017-11-28 18:38:34'),(12,2,'댓글43','고길동','2017-11-28 18:38:34'),(13,1,'댓글11','일지매','2017-11-28 18:38:34'),(14,1,'댓글12','홍길동','2017-11-28 18:38:34'),(15,1,'댓글13','이순신','2017-11-28 18:38:34'),(16,2,'댓글21','임꺽정','2017-11-28 18:38:34'),(17,2,'댓글22','김기동','2017-11-28 18:38:34'),(18,2,'댓글23','고길동','2017-11-28 18:38:34'),(19,3,'댓글31','일지매','2017-11-28 18:38:34'),(20,3,'댓글32','홍길동','2017-11-28 18:38:34'),(21,3,'댓글33','이순신','2017-11-28 18:38:34'),(22,4,'댓글41','임꺽정','2017-11-28 18:38:34'),(23,4,'댓글42','김기동','2017-11-28 18:38:34'),(24,4,'댓글43','고길동','2017-11-28 18:38:34'),(25,5,'댓글11','일지매','2017-11-28 18:38:34'),(26,5,'댓글12','홍길동','2017-11-28 18:38:34'),(27,5,'댓글13','이순신','2017-11-28 18:38:34'),(28,6,'댓글21','임꺽정','2017-11-28 18:38:34'),(29,6,'댓글22','김기동','2017-11-28 18:38:34'),(30,6,'댓글23','고길동','2017-11-28 18:38:34'),(31,7,'댓글31','일지매','2017-11-28 18:38:34'),(32,7,'댓글32','홍길동','2017-11-28 18:38:34'),(33,7,'댓글33','이순신','2017-11-28 18:38:34'),(34,8,'댓글41','임꺽정','2017-11-28 18:38:34'),(35,8,'댓글42','김기동','2017-11-28 18:38:34'),(36,8,'댓글43','고길동','2017-11-28 18:38:34'),(37,9,'댓글11','일지매','2017-11-28 18:38:34'),(38,9,'댓글12','홍길동','2017-11-28 18:38:34'),(39,9,'댓글13','이순신','2017-11-28 18:38:34'),(40,10,'댓글21','임꺽정','2017-11-28 18:38:34'),(41,10,'댓글22','김기동','2017-11-28 18:38:34'),(42,10,'댓글23','고길동','2017-11-28 18:38:34'),(43,11,'댓글31','일지매','2017-11-28 18:38:34'),(44,11,'댓글32','홍길동','2017-11-28 18:38:34'),(45,12,'댓글33','이순신','2017-11-28 18:38:34'),(46,12,'댓글41','임꺽정','2017-11-28 18:38:34'),(47,12,'댓글42','김기동','2017-11-28 18:38:34'),(48,13,'댓글43','고길동','2017-11-28 18:38:34'),(49,13,'댓글11','일지매','2017-11-28 18:38:34'),(50,13,'댓글12','홍길동','2017-11-28 18:38:34'),(51,14,'댓글13','이순신','2017-11-28 18:38:34'),(52,14,'댓글21','임꺽정','2017-11-28 18:38:34'),(53,14,'댓글22','김기동','2017-11-28 18:38:34'),(54,15,'댓글23','고길동','2017-11-28 18:38:34'),(55,15,'댓글31','일지매','2017-11-28 18:38:34'),(56,15,'댓글32','홍길동','2017-11-28 18:38:34'),(57,16,'댓글33','이순신','2017-11-28 18:38:34'),(58,16,'댓글41','임꺽정','2017-11-28 18:38:34'),(59,16,'댓글42','김기동','2017-11-28 18:38:34'),(60,16,'댓글43','고길동','2017-11-28 18:38:35'),(61,5,'댓글11','일지매','2017-11-28 18:38:35'),(62,5,'댓글12','홍길동','2017-11-28 18:38:35'),(63,5,'댓글13','이순신','2017-11-28 18:38:35'),(64,6,'댓글21','임꺽정','2017-11-28 18:38:35'),(65,6,'댓글22','김기동','2017-11-28 18:38:35'),(66,6,'댓글23','고길동','2017-11-28 18:38:35'),(67,7,'댓글31','일지매','2017-11-28 18:38:35'),(68,7,'댓글32','홍길동','2017-11-28 18:38:35'),(69,7,'댓글33','이순신','2017-11-28 18:38:35'),(70,8,'댓글41','임꺽정','2017-11-28 18:38:35'),(71,8,'댓글42','김기동','2017-11-28 18:38:35'),(72,8,'댓글43','고길동','2017-11-28 18:38:35');
/*!40000 ALTER TABLE `reply` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-11-30 11:44:43
